app/controllers/books_controller.rb

SELECT * FROM "books" WHERE ("books"."id" = 3)
---
  def show
    @book = Book.find(params[:id])

SELECT * FROM "books" WHERE ("books"."id" = 1)
---
  def edit
    @book = Book.find(params[:id])

SELECT * FROM "books" WHERE ("books"."id" = 1)
---
  def update
    @book = Book.find(params[:id])

SELECT * FROM "books" WHERE ("books"."id" = 1)
DELETE FROM "books" WHERE "id" = 1
---
  def destroy
    @book = Book.find(params[:id])
    @book.destroy