app/controllers/pictures_controller.rb

  def destroy
    @picture = Picture.find(params[:id])
    @book_id = @picture.book.id
    if @picture.destroy
---
SELECT * FROM "pictures" WHERE ("pictures".parent_id = 1)
DELETE FROM "pictures" WHERE "id" = 2